# -*- coding: utf-8 -*-
import nltk
from nltk.tokenize import word_tokenize
from nltk.corpus import PlaintextCorpusReader

D = ['چھی', 'معلومات', 'کا',
     'انعا', 'اللہ', ':', 'آ', 'چھی', 'بات', 'کٹ', 'کودُو', 'تُو', 'مھے', 'یے', 'ایک', 'تا', 'میس', 'بندا', 'یرأ',
     'مھون', 'أ', 'سینکین', 'سی', 'أ', 'کوستینی', 'یے', 'تھیدا', 'یعنی', 'ساتال', 'ما', 'گھین', 'آنئ', 'بیشتے', 'بلکہ',
     'مِشکُو', 'سی', 'چأل', 'ما', 'گھین', 'آنئ', 'بیشتے', 'قارندُکے', 'آ', 'پورے', '،', 'أ', 'سینکین', 'سی', 'بھئ',
     'یے', 'تھیدا', 'ایمی', 'پیم', 'دیش', 'یے', 'چھیدا', 'ایمی', 'بارہ', 'می', 'مے', 'بات', 'بندی', 'ییرأ', 'ہے',
     'دوتر', 'نی', 'چھی', 'ہے', 'دھیمی', 'ہوجی', '،', 'ہے', 'مانکو', 'ما', 'گھین', 'آ', 'بیشتے', 'پشمال', 'أ', 'پورے',
     'أرأنہ', 'پورے', '،', 'لیکن', 'أ', 'دُوئی', 'دیش', 'یے', 'چھیدا', 'ہے', 'چونسٹھ', 'زیت', 'تقسیم', 'چھی', 'دَ',
     'تُو', 'اسی', 'مھوئے', 'مختصر', 'بن', 'دا', 'یرأ','تُونُو' , 'تُو', 'اسی', 'اے', 'دیشا', 'گھین', '،', 'کامے', 'اے', 'دیشا',
     'گھین', '،', 'یرأ', 'کامے', 'پود', 'کامے', 'قوم', 'تھو', '،', 'چھی', 'معلومات', 'کا', 'بندی', '؟',
     'نوشیر', 'چموٹ', ':', 'میمی', 'أ', 'بھونیم', 'ساتال', 'بلکہ', 'مشکو', 'سی', 'چأل', 'ما', 'تو', 'گھین', 'آں',
     'بیشتے', 'توال', 'آ', 'پورے', '،', 'کمل', 'سی', 'بیریدآ', 'پورے', '،', 'مھیت', 'میس', 'کے', 'بندی', 'بھونیم'
    , 'قومیت', 'معصوم', 'آباد', 'ما', 'وائے', 'گھین', 'أ', 'چَو', 'قوم', 'وائے', 'آباد', 'تھی', 'چَو', 'قوم', 'بھائے',
     'آباد', 'تھی', 'آٹھ', 'قوم', 'آ', 'زیت', 'مھوئی', 'میس', 'بٹاؤ', 'کیدو', 'بنیادی', 'تھی', 'ہے', 'چَو', 'قوم', '،',
     'لیکن', 'ہین', 'شاخ', 'آشیئ', 'اے', 'بھا', 'بئیل', 'دھرُودُو', 'اے', 'بھا', 'مھیت', 'دھرُودُو', '،', 'اے', 'بھا',
     'بیل', 'تُھو', 'ایک', 'بھا', 'مھیت', 'تھو', 'دُو', 'بھئ', 'بیل', 'تھی', 'دُو', 'بھئ', 'مھید', 'تھی', 'دَ', 'تیمی',
     'بنیادی', 'بات', 'أ', 'چھی', 'یرأ', 'میمی', 'بھون', 'یے', 'کامیک', 'تھودا', 'مے', 'کھأرا', 'پھائے', 'میس', 'کے',
     'بنودُود', 'بھونال','بھیئی', 'مے', 'پود','ہوئی' ,'سی', 'نام', 'بھونال', 'آشو', 'مے', 'بحرین', 'سی', 'نام', 'بھونال', 'آشُو',
     'مھے', 'کھارآ', 'پھائے', 'اِس', 'کے', 'بھونال', 'بنودود', 'کھأرآ', 'اپکے', 'مسکے', 'توروال', 'بنودُود', 'أ',
     'درال', 'سی', 'کھار', 'ئے', 'کامیک', 'أ', 'چھیدا', 'تُھو','أ', 'بیرید', 'أشِی', 'پھائے', 'بھونال', 'زیت', 'ییدا',
     'بجُودُود', 'متکے', 'توروال', 'ڙید', 'ییدا', 'بیودُود', ,'مھی','تا', 'بھونال', 'می', 'اے', 'کیو', 'یی', 'بھونال', 'سیت',
     'ٹل', 'آشیئ', 'بیسے', 'یی', 'بھونال', 'سیت', 'ٹل', 'آشُو', 'نرے', 'مے', 'ڈھأر', 'کے', 'ذأنی', 'آشُو', 'لیکن',
     'چونکہ', 'أ', 'بحرین', 'سی', 'گام', 'یے', 'سَوا', 'گودُودا', 'أ', 'تواریخ', 'می', 'أ', 'چر', 'بعد', 'می', 'سوا',
     'گودُوـ', 'میاں', 'قاسم', 'بابا', 'سی', 'وخ', 'می', 'سے', 'ئے', 'کامے', 'وخ', 'می', 'آپ', 'تی', 'مھید', 'دعوت',
     'تبلیغ', 'شروع', 'کی', 'میل', 'ٹول', 'کُفر', 'آشُو', 'مے', 'ڈھأر', 'کے', 'تہ', 'کامے', 'وخ', 'می', 'یے', 'تی',
     'میل', 'دعوت', 'تبلیغ', 'سی', 'ذریعہ', 'دے', 'مھأ', 'خلق', 'مسلمان', 'کی', 'أ', 'پود', 'ئے', 'کامیک', 'آشُودا',
     'أ', 'مے', 'نھید', 'سی', 'اے', 'جزیرہ', 'آشُو', 'پہ', 'ڈھارا', 'پئے', 'نھد', 'بندی']

def max_match(sentence, dictionary):
    if not sentence:
        return ""
    for i in range(len(sentence), -1, -1):
        first_word = sentence[:i]
        remainder = sentence[i:]
        if first_word in dictionary:
            return first_word + " " + max_match(remainder, dictionary)
        first_word = sentence[0]
        remainder = sentence[1:]
    return first_word + max_match(remainder, dictionary)

print(max_match(' ', D))
